---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.RailTagentJoinOption.AddVerticalOrHorizontalSegments
enum: Autodesk.Revit.DB.Architecture.RailTagentJoinOption
source: html/ea503e96-b3eb-172e-acb4-180bfad56652.htm
---
# Autodesk.Revit.DB.Architecture.RailTagentJoinOption.AddVerticalOrHorizontalSegments

Add vertical or horizontal segments.